tutorials/multiform/equilibriumEulerianFoam/2DheterogeneousMedia/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu              nu [0 2 -1 0 0 0 0] 1;
Dc              Dc [0 2 -1 0 0 0 0] 1e-4;
cm              cm [0 0 0 0 0 0 0] 0.6;
St              St [0 0 1 0 0 0 0] 3e-2;
// ************************************************************************* //
